In [1]:
import sqlite3
import pandas as pd

In [6]:
conn = sqlite3.connect('dbs/test.db')

In [7]:
cursor = conn.cursor()

cursor.execute('''
    CREATE TABLE IF NOT EXISTS employees (
        id INTEGER PRIMARY KEY,
        name TEXT,
        department TEXT,
        salary INTEGER
    )
''')

cursor.executemany('INSERT INTO employees (name, department, salary) VALUES (?, ?, ?)', [
    ('Alice', 'Engineering', 80000),
    ('Bob', 'Engineering', 90000),
    ('Charlie', 'HR', 70000)
])

conn.commit()

In [8]:
# Sample query: Employees with salary > 75000
query = "SELECT name, salary FROM employees WHERE salary > 75000"
df = pd.read_sql_query(query, conn)
df

    name  salary
0  Alice   80000
1    Bob   90000

In [9]:
conn.close()